/*
Напишите программу, которая на вход принимает число и выдаёт его квадрат.
*/
Console.Write("Введите ваше число: ");
int userNumber = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(userNumber*userNumber);

